examples/square2D_VIV_multiprocessing/env03/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
18474
(
(2.0000501 -0.00036494118 0)
(2.0000003 -0.00064136372 0)
(2.0000247 -0.00070766184 0)
(2.0000024 -0.00085231323 0)
(2.0000133 -0.0009259218 0)
(2.000004 -0.0010202187 0)
(2.0000073 -0.001082275 0)
(2.000003 -0.0011440094 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    syms
    {
        type            zeroGradient;
    }
    front1
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.001;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    front2
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.001;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    middle1
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.001;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    middle2
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.001;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    back1
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.001;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    back2
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.001;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            movingWallVelocity;
        value           nonuniform List<vector> 
128
(
(2.0492155e-08 0.40477295 -1.3849256e-33)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
