examples/square2D_VIV_multiprocessing/env03/0/Uf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceVectorField;
    location    "10";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
36597
(
(2.0000251 -0.00055206599 0)
(2.0002505 -0.00081653259 0)
(2.0000126 -0.00064544077 0)
(2.000094 -0.0013706122 0)
(2.0000134 -0.0007992762 0)
(2.0001571 -0.0014996758 0)
(2.0000079 -0.00087769736 0)
(2.0000817 -0.0018219542 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (2 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
134
(
(2.0277949 -0.01784658 0)
(2.0287119 -0.016716164 0)
(2.0304519 -0.016416659 0)
(2.0322578 -0.015412261 0)
(2.0344158 -0.01492347 0)
(2.0365731 -0.014014586 0)
(2.0388911 -0.013414293 0)
(2.0411532 -0.012580919 0)
...
)
;
    }
    syms
    {
        type            calculated;
        value           nonuniform List<vector> 
294
(
(2.0000501 -0.00030157857 0)
(2.0004499 -0.001174425 0)
(2.0011821 -0.0022206528 0)
(2.0021839 -0.003392615 0)
(2.0034319 -0.0046519395 0)
(2.0048954 -0.0059568005 0)
(2.006532 -0.0072610793 0)
(2.0082964 -0.0085221396 0)
...
)
;
    }
    front1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    middle1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    middle2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(2.0492155e-08 0.40477295 -1.3849256e-33)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
(0 0.40477295 0)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
