examples/square2D_VIV_multiprocessing/env03/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
18474
(
0.072695585
0.07552716
0.077532831
0.080670821
0.08362535
0.087039453
0.090415518
0.093922001
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    syms
    {
        type            zeroGradient;
    }
    front1
    {
        type            zeroGradient;
    }
    front2
    {
        type            zeroGradient;
    }
    middle1
    {
        type            zeroGradient;
    }
    middle2
    {
        type            zeroGradient;
    }
    back1
    {
        type            zeroGradient;
    }
    back2
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
