examples/square2D_VIV_multiprocessing/env03/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (0.075 0.075 0)
    (0.1 0.075 0)
    (0.125 0.075 0)
    (0.15 0.075 0)
    (0.175 0.075 0)
    (0.2 0.075 0)
    (0.225 0.075 0)//
    (0.075 0.05 0)
    (0.1 0.05 0)
    (0.125 0.05 0)
    (0.15 0.05 0)
    (0.175 0.05 0)
    (0.2 0.05 0)
    (0.225 0.05 0)//
    (0.075 0.025 0)
    (0.1 0.025 0)
    (0.125 0.025 0)
    (0.15 0.025 0)
    (0.175 0.025 0)
    (0.2 0.025 0)
    (0.225 0.025 0)//
    (0.075 0 0)
    (0.1 0 0)
    (0.125 0 0)
    (0.15 0 0)
    (0.175 0 0)
    (0.2 0 0)
    (0.225 0 0)//
    (0.075 -0.075 0)
    (0.1 -0.075 0)
    (0.125 -0.075 0)
    (0.15 -0.075 0)
    (0.175 -0.075 0)
    (0.2 -0.075 0)
    (0.225 -0.075 0)//
    (0.075 -0.05 0)
    (0.1 -0.05 0)
    (0.125 -0.05 0)
    (0.15 -0.05 0)
    (0.175 -0.05 0)
    (0.2 -0.05 0)
    (0.225 -0.05 0)//
    (0.075 -0.025 0)
    (0.1 -0.025 0)
    (0.125 -0.025 0)
    (0.15 -0.025 0)
    (0.175 -0.025 0)
    (0.2 -0.025 0)
    (0.225 -0.025 0)//
);

